Repository: common-repository/order-signature-for-woocommerce
Catalog: languages/order-signature-for-woocommerce-*.po
Languages: ro_ro

source: Sorry, but this plugin requires the WooCommerce Plugin to be installed and active. <br><a href="%s">&laquo; Return to Plugins</a>
ro_ro: Ne pare rău, dar acest modul necesită ca modulul WooCommerce să fie instalat și activat. <br><a href="%s">&laquo; Înapoi la Module</a>

source: Rate This Plugin
ro_ro: Evaluează Acest Modul

source: SUPPORT
ro_ro: SUPORT

source: Settings
ro_ro: Setări

source: Done Signing
ro_ro: Semnează

source: Clear Signature
ro_ro: Șterge Semnătura

source: Terms and Conditions
ro_ro: Termeni și Condiții

source: By signing below you agree with the terms and conditions.
ro_ro: Prin semnarea dumneavoastră sunteți de acord cu termenii și condițiile.

source: Your Signature
ro_ro: Semnătura ta

source: Redraw Signature
ro_ro: Redesenează Semnătura

source: Please add your signature!
ro_ro: Te rog să adaugi semnătura!

source: Change Payment Method
ro_ro: Schimbă Metoda de Plată

source: Customer Signature
ro_ro: Semnătură Client

source: There is no signature for this order.
ro_ro: Nu există nicio semnătura pentru această comandă.

source: Signature Settings
ro_ro: Setări Semnătură

source: "Done Signing" Button Text
ro_ro: Text Buton "Semnează"

source: "Clear Signature" Button Text
ro_ro: Text Buton "Șterge Semnătura"

source: Signature color
ro_ro: Culoarea semnăturii

source: Signature stroke thickness
ro_ro: Grosimea liniei semnăturii

source: in pixels
ro_ro: în pixeli

source: Signature error alert error message
ro_ro: Mesajul de alertă al erorii de semnătură

source: Please draw at least a duck :) Sorry for the inconvenience, but we need to be compliant with tax and documents regulations here as well. Thank you for understanding!
ro_ro: Te rog să desenezi cel puțin o rață :) Ne pare rău pentru inconveniente, dar trebuie să respectăm reglementările fiscale și ale documentelor. Îți mulțumim pentru înțelegere!

source: Custom field title
ro_ro: Titlu câmp personalizat

source: Default text
ro_ro: Textul standard

source: Custom field text
ro_ro: Text câmp personalizat

source: "Customer Signature" Text
ro_ro: Text "Semnătură Client"

source: "Customer Signature" Text Size
ro_ro: Mărime Text "Semnătură Client"

source: Signature
ro_ro: Semnătură
